TexasInstruments/mcupsdk-core/examples/drivers/ecap/ecap_signal_monitoring/am263px-cc/r5fss0-0_nortos/example.syscfg
ecap5.$name                  = "MON_POSEDGE";
ecap5.ecapBase               = "CSL_CONTROLSS_ECAP4_U_BASE";
ecap5.reArm                  = true;
ecap5.resetCounters          = true;
ecap5.enableLoadCounter      = true;
ecap5.interruptSourceCapture = ["ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT2","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT2"];
ecap5.enableInterrupt        = true;
ecap5.enable_monitorunit1    = true;
ecap5.monitorSelect_1        = "ECAP_MUNIT_MONITOR_RISE_EDGE";
ecap5.enableDebug_1          = true;
ecap5.minValue_1             = 4900;
ecap5.maxValue_1             = 5100;
ecap5.ecapInput              = "ECAP_INPUT_INPUTXBAR0";
ecap5.syncInPulseSource      = "ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM0";

ecap6.$name                  = "MON_NEGEDGE";
ecap6.ecapBase               = "CSL_CONTROLSS_ECAP5_U_BASE";
ecap6.enableLoadCounter      = true;
ecap6.resetCounters          = true;
ecap6.reArm                  = true;
ecap6.eventOnePolarity       = "ECAP_EVNT_FALLING_EDGE";
ecap6.enableInterrupt        = true;
ecap6.interruptSourceCapture = ["ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT2","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT2"];
ecap6.enable_monitorunit1    = true;
ecap6.monitorSelect_1        = "ECAP_MUNIT_MONITOR_FALL_EDGE";
ecap6.minValue_1             = 14900;
ecap6.maxValue_1             = 15100;
ecap6.enableDebug_1          = true;
ecap6.ecapInput              = "ECAP_INPUT_INPUTXBAR0";
ecap6.syncInPulseSource      = "ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM0";

epwm1.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm1.epwmTimebase_period                                      = 19999;
epwm1.$name                                                    = "INPUT_EPWM";
epwm1.epwmEventTrigger_enableInterrupt                         = true;
epwm1.epwmEventTrigger_interruptSource                         = "EPWM_INT_TBCTR_PERIOD";
epwm1.epwmEventTrigger_interruptEventCount                     = "1";
epwm1.epwmEventTrigger_interruptEventCountInitEnable           = true;
epwm1.epwmCounterCompare_cmpA                                  = 4999;
epwm1.epwmCounterCompare_cmpB                                  = 14999;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmTimebase_syncOutPulseMode                            = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO","EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm1.EPWM.$assign                                             = "EPWM0";
epwm1.EPWM.A.$assign                                           = "EPWM0_A";
epwm1.EPWM.B.$used                                             = false;

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

default_linker1.$name = "memory_configurator_default_linker0";

general1.$name        = "CONFIG_GENERAL0";
general1.linker.$name = "TIARMCLANG0";

region1.$name                                = "MEMORY_REGION_CONFIGURATION0";
region1.memory_region.create(11);
region1.memory_region[0].type                = "TCMA";
region1.memory_region[0].$name               = "R5F_VECS";
region1.memory_region[0].size                = 0x40;
region1.memory_region[0].auto                = false;
region1.memory_region[1].type                = "TCMA";
region1.memory_region[1].$name               = "R5F_TCMA";
region1.memory_region[1].size                = 0x7FC0;
region1.memory_region[2].type                = "TCMB";
region1.memory_region[2].size                = 0x8000;
region1.memory_region[2].$name               = "R5F_TCMB";
region1.memory_region[3].$name               = "SBL";
region1.memory_region[3].auto                = false;
region1.memory_region[3].size                = 0x40000;
region1.memory_region[4].$name               = "OCRAM";
region1.memory_region[4].auto                = false;
region1.memory_region[4].manualStartAddress  = 0x70040000;
region1.memory_region[4].size                = 0x40000;
region1.memory_region[5].type                = "FLASH";
region1.memory_region[5].auto                = false;
region1.memory_region[5].manualStartAddress  = 0x60100000;
region1.memory_region[5].size                = 0x80000;
region1.memory_region[5].$name               = "FLASH";
region1.memory_region[6].$name               = "USER_SHM_MEM";
region1.memory_region[6].auto                = false;
region1.memory_region[6].manualStartAddress  = 0x701D0000;
region1.memory_region[6].size                = 0x4000;
region1.memory_region[6].isShared            = true;
region1.memory_region[6].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[7].$name               = "LOG_SHM_MEM";
region1.memory_region[7].auto                = false;
region1.memory_region[7].manualStartAddress  = 0x701D4000;
region1.memory_region[7].size                = 0x4000;
region1.memory_region[7].isShared            = true;
region1.memory_region[7].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[8].type                = "CUSTOM";
region1.memory_region[8].$name               = "RTOS_NORTOS_IPC_SHM_MEM";
region1.memory_region[8].auto                = false;
region1.memory_region[8].manualStartAddress  = 0x72000000;
region1.memory_region[8].size                = 0x3E80;
region1.memory_region[8].isShared            = true;
region1.memory_region[8].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[9].type                = "CUSTOM";
region1.memory_region[9].$name               = "MAILBOX_HSM";
region1.memory_region[9].auto                = false;
region1.memory_region[9].manualStartAddress  = 0x44000000;
region1.memory_region[9].size                = 0x3CE;
region1.memory_region[9].isShared            = true;
region1.memory_region[9].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[10].type               = "CUSTOM";
region1.memory_region[10].$name              = "MAILBOX_R5F";
region1.memory_region[10].auto               = false;
region1.memory_region[10].manualStartAddress = 0x44000400;
region1.memory_region[10].size               = 0x3CE;
region1.memory_region[10].isShared           = true;
region1.memory_region[10].shared_cores       = ["r5fss0-1","r5fss1-0","r5fss1-1"];

